Documents/КорректировкаНазначенияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>КорректировкаНазначенияТоваров</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацийКорректировкиНазначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ВидыОперацийКорректировкиНазначения</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СнятьРезерв</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятьРезервПоМногимНазначениям</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезервироватьИКорректировать</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Резервировать</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольнаяКорректировкаНазначений</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/КорректировкаНазначенияТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// #wortmann {
	// #5.2.08
	// настройка дополнительных элементов формы 
	// Галфинд Sakovich 2022/08/09
	НастроитьДополнительныеЭлементы();
	// } #wortmann
КонецПроцедуры

// #wortmann {
// #5.2.08
// настройка дополнительных элементов формы 
// Галфинд Sakovich 2022/08/09
&НаСервере
Процедура НастроитьДополнительныеЭлементы()
	ТипПолеФормы = Тип("ПолеФормы");
	ТипТаблицаФормы = Тип("ТаблицаФормы");
	ТипКнопкаФормы = Тип("КнопкаФормы");
	ТипГруппаФормы = Тип("ГруппаФормы");
	
	НовыйЭлемент = Элементы.Вставить("гф_IDкороба", ТипПолеФормы,
		Элементы.Товары);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
    НовыйЭлемент.ПутьКДанным = "Объект.Товары.гф_IDкороба";
	НовыйЭлемент.Заголовок = "ID короба";
	НастроитьВидимостьIDкороба();
КонецПроцедуры // } #wortmann

// #wortmann {
// #5.2.08
// 
// Галфинд Sakovich 2022/08/09
&НаСервере
Процедура НастроитьВидимостьIDкороба()
	Элементы.гф_IDкороба.Видимость = 
	(Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкиНазначения.СнятьРезерв")
	ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкиНазначения.СнятьРезервПоМногимНазначениям)"));
КонецПроцедуры // } #wortmann

// #wortmann {
// #5.2.08
// 
// Галфинд Sakovich 2022/08/09
&НаКлиенте
&После("ВидОперацииОбработкаВыбораЗавершение")
Процедура гф_ВидОперацииОбработкаВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры)
	НастроитьВидимостьIDкороба();
КонецПроцедуры // } #wortmann

#КонецОбласти
